{
  "main": {
    "summary": "I'm a dynamic Full-Stack Web Developer with a reputation for adaptability and swiftly learning and integrating new technologies. My breadth of knowledge encompasses designing user-friendly frontends to constructing robust backend systems, ensuring the delivery of comprehensive and efficient web applications. With a keen eye for detail and a strong commitment to usability, I strive to create exceptional user experiences across desktop and mobile platforms. I pride myself on my ability to foster seamless communication, adept at bridging the gap between the technical and non-technical worlds. Beyond my programming prowess, I enjoy serving as a mentor, guiding budding engineers along their career paths, sharing insights and experiences to help them grow.",
    "wup": {
      "copy": "At Wheels Up, I currently contribute to the Members Site application built in React with typescript. Here I am able to build new features and contribute to decisions on high level architecture for our application.",
      "image": {
        "src": "/wup.svg",
        "alt": "Wheels Up Logo"
      },
      "href": "/professional/wheelsup"
    },
    "pin": {
      "copy": "At Project Innovate Newark, I helped build 2 client side React applications and a Flask server applicaiton from the ground up to provide dynamic content, an administrative app, and deliver on various business needs.",
      "image": {
        "src": "/pin-logo.PNG",
        "alt": "Project Innovate Newark Logo"
      },
      "href": "/professional/pin"
    }
  },
  "ms": "Spearheaded the transformation of a member site, implementing innovative features and refining user interfaces, which resulted in a significant 10% improvement in service times. Through advanced techniques in client-side caching, I achieved an enhanced site performance, guaranteeing a seamless browsing experience across desktop and mobile devices. By creatively employing CSS and GSAP, I sculpted a luxurious digital journey for members, and my expertise in code refactoring transformed and modernized legacy components. Keen to stay at the forefront of technology, I ensured the use of the latest tools and methods to push the boundaries of user interaction. Discover more about how my work brought about impactful transformations.",
  "azure": "In a collaborative, cross-functional role, I successfully led the migration of all frontend services from Rackspace cloud services to the more robust Microsoft Azure. I implemented Kubernetes ConfigMaps in Azure Kubernetes Service, enhancing runtime environment variable utilization. Beyond this, I worked diligently to familiarize all frontend teams with the Azure CI/CD process, ensuring a smooth transition and maintaining the team's efficiency.",
  "misc": "With my ability to manage complex projects, I coordinated with multiple teams to deliver concurrent features, sustaining momentum without compromising on quality. I curated comprehensive documentation encompassing a range of topics from infrastructure to library usage, facilitating seamless team operations. My responsibilities extended to onboarding new team members, fostering an inclusive and efficient work environment, and conducting coding round interviews to identify potential talent. Dive in to discover more about my dynamic role in enhancing team efficiency and productivity.",
  "pinFE": "I expertly designed and implemented cutting-edge UI/UX features, meticulously optimized for desktop and mobile browsers. My creative use of CSS animations significantly elevated the user experience. With my technical acumen, I refactored the external facing React application, leveraging React Hooks to enhance functionality. To bolster efficiency, I established a CI/CD deployment cycle for app deployment to Google Kubernetes Engine cluster.",
  "pinBE": "Architected a resilient Flask API and Postgres database to seamlessly support frontend clients. I integrated Google Cloud Storage for dynamic, environment-based image storage, elevating the system's capabilities. In collaboration with program coordinators, I advanced administrative features and crafted intricate access privileges for students and teachers, enhancing the system's security and functionality.",
  "pinMisc": "I have a strong commitment to mentorship. I guided budding engineers in adopting best practices, system design and architecture, and personal project planning. I worked closely with apprentice-level engineers, facilitating their transition into the team. My role also extended to providing crucial support and constructive feedback to colleagues, helping them refine their technical skills. Explore more to learn about my multi-faceted contributions."

}